GopalSaraf/Practicals/PSDL/include/proc/pic16f18445.h
// Register: NCO1CLK
#define NCO1CLK NCO1CLK
extern volatile unsigned char           NCO1CLK             __at(0x593);
#ifndef _LIB_BUILD
asm("NCO1CLK equ 0593h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKS                    :4;
        unsigned                        :1;
        unsigned PWS                    :3;
    };
    struct {
        unsigned CKS0                   :1;
        unsigned CKS1                   :1;
        unsigned CKS2                   :1;
        unsigned CKS3                   :1;
        unsigned                        :1;
        unsigned PWS0                   :1;
        unsigned PWS1                   :1;
        unsigned PWS2                   :1;
    };
    struct {
        unsigned NCO1CKS                :4;
        unsigned                        :1;
        unsigned NCO1PWS                :3;
    };
    struct {
        unsigned NCO1CKS0               :1;
        unsigned NCO1CKS1               :1;
        unsigned NCO1CKS2               :1;
        unsigned NCO1CKS3               :1;
        unsigned                        :1;
        unsigned NCO1PWS0               :1;
        unsigned NCO1PWS1               :1;
        unsigned NCO1PWS2               :1;
    };
} NCO1CLKbits_t;
extern volatile NCO1CLKbits_t NCO1CLKbits __at(0x593);
// bitfield macros
#define _NCO1CLK_CKS_POSN                                   0x0
#define _NCO1CLK_CKS_POSITION                               0x0
#define _NCO1CLK_CKS_SIZE                                   0x4
#define _NCO1CLK_CKS_LENGTH                                 0x4
#define _NCO1CLK_CKS_MASK                                   0xF
#define _NCO1CLK_PWS_POSN                                   0x5
#define _NCO1CLK_PWS_POSITION                               0x5
#define _NCO1CLK_PWS_SIZE                                   0x3
#define _NCO1CLK_PWS_LENGTH                                 0x3
#define _NCO1CLK_PWS_MASK                                   0xE0
#define _NCO1CLK_CKS0_POSN                                  0x0
#define _NCO1CLK_CKS0_POSITION                              0x0
#define _NCO1CLK_CKS0_SIZE                                  0x1
#define _NCO1CLK_CKS0_LENGTH                                0x1
#define _NCO1CLK_CKS0_MASK                                  0x1
#define _NCO1CLK_CKS1_POSN                                  0x1
#define _NCO1CLK_CKS1_POSITION                              0x1
#define _NCO1CLK_CKS1_SIZE                                  0x1
#define _NCO1CLK_CKS1_LENGTH                                0x1
#define _NCO1CLK_CKS1_MASK                                  0x2
#define _NCO1CLK_CKS2_POSN                                  0x2
#define _NCO1CLK_CKS2_POSITION                              0x2
#define _NCO1CLK_CKS2_SIZE                                  0x1
#define _NCO1CLK_CKS2_LENGTH                                0x1
#define _NCO1CLK_CKS2_MASK                                  0x4
#define _NCO1CLK_CKS3_POSN                                  0x3
#define _NCO1CLK_CKS3_POSITION                              0x3
#define _NCO1CLK_CKS3_SIZE                                  0x1
#define _NCO1CLK_CKS3_LENGTH                                0x1
#define _NCO1CLK_CKS3_MASK                                  0x8
#define _NCO1CLK_PWS0_POSN                                  0x5
#define _NCO1CLK_PWS0_POSITION                              0x5
#define _NCO1CLK_PWS0_SIZE                                  0x1
#define _NCO1CLK_PWS0_LENGTH                                0x1
#define _NCO1CLK_PWS0_MASK                                  0x20
#define _NCO1CLK_PWS1_POSN                                  0x6
#define _NCO1CLK_PWS1_POSITION                              0x6
#define _NCO1CLK_PWS1_SIZE                                  0x1
#define _NCO1CLK_PWS1_LENGTH                                0x1
#define _NCO1CLK_PWS1_MASK                                  0x40
#define _NCO1CLK_PWS2_POSN                                  0x7
#define _NCO1CLK_PWS2_POSITION                              0x7
#define _NCO1CLK_PWS2_SIZE                                  0x1
#define _NCO1CLK_PWS2_LENGTH                                0x1
#define _NCO1CLK_PWS2_MASK                                  0x80
#define _NCO1CLK_NCO1CKS_POSN                               0x0
#define _NCO1CLK_NCO1CKS_POSITION                           0x0
#define _NCO1CLK_NCO1CKS_SIZE                               0x4
#define _NCO1CLK_NCO1CKS_LENGTH                             0x4
#define _NCO1CLK_NCO1CKS_MASK                               0xF
#define _NCO1CLK_NCO1PWS_POSN                               0x5
#define _NCO1CLK_NCO1PWS_POSITION                           0x5
#define _NCO1CLK_NCO1PWS_SIZE                               0x3
#define _NCO1CLK_NCO1PWS_LENGTH                             0x3
#define _NCO1CLK_NCO1PWS_MASK                               0xE0
#define _NCO1CLK_NCO1CKS0_POSN                              0x0
#define _NCO1CLK_NCO1CKS0_POSITION                          0x0
#define _NCO1CLK_NCO1CKS0_SIZE                              0x1
#define _NCO1CLK_NCO1CKS0_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS0_MASK                              0x1
#define _NCO1CLK_NCO1CKS1_POSN                              0x1
#define _NCO1CLK_NCO1CKS1_POSITION                          0x1
#define _NCO1CLK_NCO1CKS1_SIZE                              0x1
#define _NCO1CLK_NCO1CKS1_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS1_MASK                              0x2
#define _NCO1CLK_NCO1CKS2_POSN                              0x2
#define _NCO1CLK_NCO1CKS2_POSITION                          0x2
#define _NCO1CLK_NCO1CKS2_SIZE                              0x1
#define _NCO1CLK_NCO1CKS2_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS2_MASK                              0x4
#define _NCO1CLK_NCO1CKS3_POSN                              0x3
#define _NCO1CLK_NCO1CKS3_POSITION                          0x3
#define _NCO1CLK_NCO1CKS3_SIZE                              0x1
#define _NCO1CLK_NCO1CKS3_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS3_MASK                              0x8
#define _NCO1CLK_NCO1PWS0_POSN                              0x5
#define _NCO1CLK_NCO1PWS0_POSITION                          0x5
#define _NCO1CLK_NCO1PWS0_SIZE                              0x1
#define _NCO1CLK_NCO1PWS0_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS0_MASK                              0x20
#define _NCO1CLK_NCO1PWS1_POSN                              0x6
#define _NCO1CLK_NCO1PWS1_POSITION                          0x6
#define _NCO1CLK_NCO1PWS1_SIZE                              0x1
#define _NCO1CLK_NCO1PWS1_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS1_MASK                              0x40
#define _NCO1CLK_NCO1PWS2_POSN                              0x7
#define _NCO1CLK_NCO1PWS2_POSITION                          0x7
#define _NCO1CLK_NCO1PWS2_SIZE                              0x1
#define _NCO1CLK_NCO1PWS2_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS2_MASK                              0x80

// Register: TMR0L
#define TMR0L TMR0L
extern volatile unsigned char           TMR0L               __at(0x59C);
#ifndef _LIB_BUILD
asm("TMR0L equ 059Ch");
#endif
// aliases
extern volatile unsigned char           TMR0                __at(0x59C);
#ifndef _LIB_BUILD
asm("TMR0 equ 059Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0L                  :8;
    };
    struct {
        unsigned TMR0L0                 :1;
        unsigned TMR0L1                 :1;
        unsigned TMR0L2                 :1;
        unsigned TMR0L3                 :1;
        unsigned TMR0L4                 :1;
        unsigned TMR0L5                 :1;
        unsigned TMR0L6                 :1;
        unsigned TMR0L7                 :1;
    };
} TMR0Lbits_t;
extern volatile TMR0Lbits_t TMR0Lbits __at(0x59C);
// bitfield macros
#define _TMR0L_TMR0L_POSN                                   0x0
#define _TMR0L_TMR0L_POSITION                               0x0
#define _TMR0L_TMR0L_SIZE                                   0x8
#define _TMR0L_TMR0L_LENGTH                                 0x8
#define _TMR0L_TMR0L_MASK                                   0xFF
#define _TMR0L_TMR0L0_POSN                                  0x0
#define _TMR0L_TMR0L0_POSITION                              0x0
#define _TMR0L_TMR0L0_SIZE                                  0x1
#define _TMR0L_TMR0L0_LENGTH                                0x1
#define _TMR0L_TMR0L0_MASK                                  0x1
#define _TMR0L_TMR0L1_POSN                                  0x1
#define _TMR0L_TMR0L1_POSITION                              0x1
#define _TMR0L_TMR0L1_SIZE                                  0x1
#define _TMR0L_TMR0L1_LENGTH                                0x1
#define _TMR0L_TMR0L1_MASK                                  0x2
#define _TMR0L_TMR0L2_POSN                                  0x2
#define _TMR0L_TMR0L2_POSITION                              0x2
#define _TMR0L_TMR0L2_SIZE                                  0x1
#define _TMR0L_TMR0L2_LENGTH                                0x1
#define _TMR0L_TMR0L2_MASK                                  0x4
#define _TMR0L_TMR0L3_POSN                                  0x3
#define _TMR0L_TMR0L3_POSITION                              0x3
#define _TMR0L_TMR0L3_SIZE                                  0x1
#define _TMR0L_TMR0L3_LENGTH                                0x1
#define _TMR0L_TMR0L3_MASK                                  0x8
#define _TMR0L_TMR0L4_POSN                                  0x4
#define _TMR0L_TMR0L4_POSITION                              0x4
#define _TMR0L_TMR0L4_SIZE                                  0x1
#define _TMR0L_TMR0L4_LENGTH                                0x1
#define _TMR0L_TMR0L4_MASK                                  0x10
#define _TMR0L_TMR0L5_POSN                                  0x5
#define _TMR0L_TMR0L5_POSITION                              0x5
#define _TMR0L_TMR0L5_SIZE                                  0x1
#define _TMR0L_TMR0L5_LENGTH                                0x1
#define _TMR0L_TMR0L5_MASK                                  0x20
#define _TMR0L_TMR0L6_POSN                                  0x6
#define _TMR0L_TMR0L6_POSITION                              0x6
#define _TMR0L_TMR0L6_SIZE                                  0x1
#define _TMR0L_TMR0L6_LENGTH                                0x1
#define _TMR0L_TMR0L6_MASK                                  0x40
#define _TMR0L_TMR0L7_POSN                                  0x7
#define _TMR0L_TMR0L7_POSITION                              0x7
#define _TMR0L_TMR0L7_SIZE                                  0x1
#define _TMR0L_TMR0L7_LENGTH                                0x1
#define _TMR0L_TMR0L7_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR0L                  :8;
    };
    struct {
        unsigned TMR0L0                 :1;
        unsigned TMR0L1                 :1;
        unsigned TMR0L2                 :1;
        unsigned TMR0L3                 :1;
        unsigned TMR0L4                 :1;
        unsigned TMR0L5                 :1;
        unsigned TMR0L6                 :1;
        unsigned TMR0L7                 :1;
    };
} TMR0bits_t;
