GopalSaraf/Practicals/PSDL/include/proc/pic16f18445.h
extern volatile __bit                   CWG1IE              __at(0x38E8);	// @ (0x71D * 8 + 0)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE7,0)
// PIR7<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x3898);	// @ (0x713 * 8 + 0)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR7,0)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x3086);	// @ (0x610 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x3093);	// @ (0x612 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x3094);	// @ (0x612 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x3095);	// @ (0x612 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD5<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x3CDD);	// @ (0x79B * 8 + 5)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD5,5)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x3080);	// @ (0x610 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x3081);	// @ (0x610 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x3082);	// @ (0x610 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x30A4);	// @ (0x614 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x30A5);	// @ (0x614 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1PPS<CWG1PPS0>
extern volatile __bit                   CWG1PPS0            __at(0xF588);	// @ (0x1EB1 * 8 + 0)
#define                                 CWG1PPS0_bit        _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1PPS1>
extern volatile __bit                   CWG1PPS1            __at(0xF589);	// @ (0x1EB1 * 8 + 1)
#define                                 CWG1PPS1_bit        _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1PPS2>
extern volatile __bit                   CWG1PPS2            __at(0xF58A);	// @ (0x1EB1 * 8 + 2)
#define                                 CWG1PPS2_bit        _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1PPS3>
extern volatile __bit                   CWG1PPS3            __at(0xF58B);	// @ (0x1EB1 * 8 + 3)
#define                                 CWG1PPS3_bit        _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1PPS4>
extern volatile __bit                   CWG1PPS4            __at(0xF58C);	// @ (0x1EB1 * 8 + 4)
#define                                 CWG1PPS4_bit        _BIT_ACCESS(CWG1PPS,4)
// CWG1AS0<CWG1REN>
extern volatile __bit                   CWG1REN             __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 CWG1REN_bit         _BIT_ACCESS(CWG1AS0,6)
// CWG1AS0<CWG1SHUTDOWN>
extern volatile __bit                   CWG1SHUTDOWN        __at(0x3097);	// @ (0x612 * 8 + 7)
#define                                 CWG1SHUTDOWN_bit    _BIT_ACCESS(CWG1AS0,7)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x30A0);	// @ (0x614 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x30A1);	// @ (0x614 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x30A2);	// @ (0x614 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x30A3);	// @ (0x614 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG2CLK<CWG2CS>
extern volatile __bit                   CWG2CS              __at(0x30B0);	// @ (0x616 * 8 + 0)
#define                                 CWG2CS_bit          _BIT_ACCESS(CWG2CLK,0)
// CWG2ISM<CWG2DAT0>
extern volatile __bit                   CWG2DAT0            __at(0x30B8);	// @ (0x617 * 8 + 0)
#define                                 CWG2DAT0_bit        _BIT_ACCESS(CWG2ISM,0)
// CWG2ISM<CWG2DAT1>
extern volatile __bit                   CWG2DAT1            __at(0x30B9);	// @ (0x617 * 8 + 1)
#define                                 CWG2DAT1_bit        _BIT_ACCESS(CWG2ISM,1)
// CWG2ISM<CWG2DAT2>
extern volatile __bit                   CWG2DAT2            __at(0x30BA);	// @ (0x617 * 8 + 2)
#define                                 CWG2DAT2_bit        _BIT_ACCESS(CWG2ISM,2)
// CWG2ISM<CWG2DAT3>
extern volatile __bit                   CWG2DAT3            __at(0x30BB);	// @ (0x617 * 8 + 3)
#define                                 CWG2DAT3_bit        _BIT_ACCESS(CWG2ISM,3)
// CWG2DBF<CWG2DBF0>
extern volatile __bit                   CWG2DBF0            __at(0x30C8);	// @ (0x619 * 8 + 0)
#define                                 CWG2DBF0_bit        _BIT_ACCESS(CWG2DBF,0)
// CWG2DBF<CWG2DBF1>
extern volatile __bit                   CWG2DBF1            __at(0x30C9);	// @ (0x619 * 8 + 1)
#define                                 CWG2DBF1_bit        _BIT_ACCESS(CWG2DBF,1)
// CWG2DBF<CWG2DBF2>
extern volatile __bit                   CWG2DBF2            __at(0x30CA);	// @ (0x619 * 8 + 2)
#define                                 CWG2DBF2_bit        _BIT_ACCESS(CWG2DBF,2)
// CWG2DBF<CWG2DBF3>
extern volatile __bit                   CWG2DBF3            __at(0x30CB);	// @ (0x619 * 8 + 3)
#define                                 CWG2DBF3_bit        _BIT_ACCESS(CWG2DBF,3)
// CWG2DBF<CWG2DBF4>
extern volatile __bit                   CWG2DBF4            __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 CWG2DBF4_bit        _BIT_ACCESS(CWG2DBF,4)
// CWG2DBF<CWG2DBF5>
extern volatile __bit                   CWG2DBF5            __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 CWG2DBF5_bit        _BIT_ACCESS(CWG2DBF,5)
// CWG2DBR<CWG2DBR0>
extern volatile __bit                   CWG2DBR0            __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 CWG2DBR0_bit        _BIT_ACCESS(CWG2DBR,0)
// CWG2DBR<CWG2DBR1>
extern volatile __bit                   CWG2DBR1            __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 CWG2DBR1_bit        _BIT_ACCESS(CWG2DBR,1)
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 CWG2DBR2_bit        _BIT_ACCESS(CWG2DBR,2)
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 CWG2DBR3_bit        _BIT_ACCESS(CWG2DBR,3)
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 CWG2DBR4_bit        _BIT_ACCESS(CWG2DBR,4)
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 CWG2DBR5_bit        _BIT_ACCESS(CWG2DBR,5)
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x30D7);	// @ (0x61A * 8 + 7)
#define                                 CWG2EN_bit          _BIT_ACCESS(CWG2CON0,7)
// PIE7<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x38E9);	// @ (0x71D * 8 + 1)
#define                                 CWG2IE_bit          _BIT_ACCESS(PIE7,1)
// PIR7<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0x3899);	// @ (0x713 * 8 + 1)
#define                                 CWG2IF_bit          _BIT_ACCESS(PIR7,1)
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x30DD);	// @ (0x61B * 8 + 5)
#define                                 CWG2IN_bit          _BIT_ACCESS(CWG2CON1,5)
// CWG2CON0<CWG2LD>
extern volatile __bit                   CWG2LD              __at(0x30D6);	// @ (0x61A * 8 + 6)
#define                                 CWG2LD_bit          _BIT_ACCESS(CWG2CON0,6)
// CWG2AS0<CWG2LSAC0>
extern volatile __bit                   CWG2LSAC0           __at(0x30E2);	// @ (0x61C * 8 + 2)
#define                                 CWG2LSAC0_bit       _BIT_ACCESS(CWG2AS0,2)
// CWG2AS0<CWG2LSAC1>
extern volatile __bit                   CWG2LSAC1           __at(0x30E3);	// @ (0x61C * 8 + 3)
#define                                 CWG2LSAC1_bit       _BIT_ACCESS(CWG2AS0,3)
// CWG2AS0<CWG2LSBD0>
extern volatile __bit                   CWG2LSBD0           __at(0x30E4);	// @ (0x61C * 8 + 4)
#define                                 CWG2LSBD0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSBD1>
extern volatile __bit                   CWG2LSBD1           __at(0x30E5);	// @ (0x61C * 8 + 5)
#define                                 CWG2LSBD1_bit       _BIT_ACCESS(CWG2AS0,5)
// PMD5<CWG2MD>
extern volatile __bit                   CWG2MD              __at(0x3CDE);	// @ (0x79B * 8 + 6)
#define                                 CWG2MD_bit          _BIT_ACCESS(PMD5,6)
// CWG2CON0<CWG2MODE0>
extern volatile __bit                   CWG2MODE0           __at(0x30D0);	// @ (0x61A * 8 + 0)
#define                                 CWG2MODE0_bit       _BIT_ACCESS(CWG2CON0,0)
// CWG2CON0<CWG2MODE1>
extern volatile __bit                   CWG2MODE1           __at(0x30D1);	// @ (0x61A * 8 + 1)
#define                                 CWG2MODE1_bit       _BIT_ACCESS(CWG2CON0,1)
// CWG2CON0<CWG2MODE2>
extern volatile __bit                   CWG2MODE2           __at(0x30D2);	// @ (0x61A * 8 + 2)
#define                                 CWG2MODE2_bit       _BIT_ACCESS(CWG2CON0,2)
// CWG2STR<CWG2OVRA>
extern volatile __bit                   CWG2OVRA            __at(0x30F4);	// @ (0x61E * 8 + 4)
#define                                 CWG2OVRA_bit        _BIT_ACCESS(CWG2STR,4)
// CWG2STR<CWG2OVRB>
extern volatile __bit                   CWG2OVRB            __at(0x30F5);	// @ (0x61E * 8 + 5)
#define                                 CWG2OVRB_bit        _BIT_ACCESS(CWG2STR,5)
// CWG2STR<CWG2OVRC>
extern volatile __bit                   CWG2OVRC            __at(0x30F6);	// @ (0x61E * 8 + 6)
#define                                 CWG2OVRC_bit        _BIT_ACCESS(CWG2STR,6)
// CWG2STR<CWG2OVRD>
extern volatile __bit                   CWG2OVRD            __at(0x30F7);	// @ (0x61E * 8 + 7)
#define                                 CWG2OVRD_bit        _BIT_ACCESS(CWG2STR,7)
// CWG2CON1<CWG2POLA>
extern volatile __bit                   CWG2POLA            __at(0x30D8);	// @ (0x61B * 8 + 0)
#define                                 CWG2POLA_bit        _BIT_ACCESS(CWG2CON1,0)
// CWG2CON1<CWG2POLB>
extern volatile __bit                   CWG2POLB            __at(0x30D9);	// @ (0x61B * 8 + 1)
#define                                 CWG2POLB_bit        _BIT_ACCESS(CWG2CON1,1)
// CWG2CON1<CWG2POLC>
extern volatile __bit                   CWG2POLC            __at(0x30DA);	// @ (0x61B * 8 + 2)
#define                                 CWG2POLC_bit        _BIT_ACCESS(CWG2CON1,2)
// CWG2CON1<CWG2POLD>
extern volatile __bit                   CWG2POLD            __at(0x30DB);	// @ (0x61B * 8 + 3)
#define                                 CWG2POLD_bit        _BIT_ACCESS(CWG2CON1,3)
// CWG2PPS<CWG2PPS0>
extern volatile __bit                   CWG2PPS0            __at(0xF590);	// @ (0x1EB2 * 8 + 0)
#define                                 CWG2PPS0_bit        _BIT_ACCESS(CWG2PPS,0)
// CWG2PPS<CWG2PPS1>
extern volatile __bit                   CWG2PPS1            __at(0xF591);	// @ (0x1EB2 * 8 + 1)
#define                                 CWG2PPS1_bit        _BIT_ACCESS(CWG2PPS,1)
// CWG2PPS<CWG2PPS2>
extern volatile __bit                   CWG2PPS2            __at(0xF592);	// @ (0x1EB2 * 8 + 2)
#define                                 CWG2PPS2_bit        _BIT_ACCESS(CWG2PPS,2)
// CWG2PPS<CWG2PPS3>
extern volatile __bit                   CWG2PPS3            __at(0xF593);	// @ (0x1EB2 * 8 + 3)
#define                                 CWG2PPS3_bit        _BIT_ACCESS(CWG2PPS,3)
// CWG2PPS<CWG2PPS4>
extern volatile __bit                   CWG2PPS4            __at(0xF594);	// @ (0x1EB2 * 8 + 4)
#define                                 CWG2PPS4_bit        _BIT_ACCESS(CWG2PPS,4)
// CWG2AS0<CWG2REN>
extern volatile __bit                   CWG2REN             __at(0x30E6);	// @ (0x61C * 8 + 6)
#define                                 CWG2REN_bit         _BIT_ACCESS(CWG2AS0,6)
// CWG2AS0<CWG2SHUTDOWN>
extern volatile __bit                   CWG2SHUTDOWN        __at(0x30E7);	// @ (0x61C * 8 + 7)
#define                                 CWG2SHUTDOWN_bit    _BIT_ACCESS(CWG2AS0,7)
// CWG2STR<CWG2STRA>
extern volatile __bit                   CWG2STRA            __at(0x30F0);	// @ (0x61E * 8 + 0)
#define                                 CWG2STRA_bit        _BIT_ACCESS(CWG2STR,0)
// CWG2STR<CWG2STRB>
extern volatile __bit                   CWG2STRB            __at(0x30F1);	// @ (0x61E * 8 + 1)
#define                                 CWG2STRB_bit        _BIT_ACCESS(CWG2STR,1)
// CWG2STR<CWG2STRC>
extern volatile __bit                   CWG2STRC            __at(0x30F2);	// @ (0x61E * 8 + 2)
#define                                 CWG2STRC_bit        _BIT_ACCESS(CWG2STR,2)
// CWG2STR<CWG2STRD>
extern volatile __bit                   CWG2STRD            __at(0x30F3);	// @ (0x61E * 8 + 3)
#define                                 CWG2STRD_bit        _BIT_ACCESS(CWG2STR,3)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x4877);	// @ (0x90E * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// PMD3<DAC1MD>
extern volatile __bit                   DAC1MD              __at(0x3CCE);	// @ (0x799 * 8 + 6)
#define                                 DAC1MD_bit          _BIT_ACCESS(PMD3,6)
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x4870);	// @ (0x90E * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x4875);	// @ (0x90E * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x4872);	// @ (0x90E * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x4873);	// @ (0x90E * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x4878);	// @ (0x90F * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x4879);	// @ (0x90F * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x487A);	// @ (0x90F * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x487B);	// @ (0x90F * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x487C);	// @ (0x90F * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x4464);	// @ (0x88C * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x4460);	// @ (0x88C * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x4461);	// @ (0x88C * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x4462);	// @ (0x88C * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x4466);	// @ (0x88C * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// PMD7<DSM1MD>
extern volatile __bit                   DSM1MD              __at(0x3CE8);	// @ (0x79D * 8 + 0)
#define                                 DSM1MD_bit          _BIT_ACCESS(PMD7,0)
// SSP1STAT<D_A1>
extern volatile __bit                   D_A1                __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 D_A1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_nA1>
extern volatile __bit                   D_nA1               __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 D_nA1_bit           _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x480);	// @ (0x90 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x481);	// @ (0x90 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x486);	// @ (0x90 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
